src/main/resources/xml/experienceMediaServiceV1/swap/swap.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.experiencemediav1.fulfillment.lodging.bussvcs.wdpr.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <ser:swap>
         <xBandReference1 manufacturerUid="?">
            <guestIdReference type="?" value="?"/>
         </xBandReference1>
         <xBandReferenc2 manufacturerUid="?">
            <guestIdReference type="?" value="?"/>
         </xBandReferenc2>
         <context>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </context>
      </ser:swap>
   </soapenv:Body>
</soapenv:Envelope>
